In [10]:
import pandas as pd

In [11]:
from importlib import reload
import functions as fun

reload(fun)

# Here we decided to use TheMovieDB movie dataframe.  
- We call it in from the .csv file and set it to a dataframe

In [22]:
df_tmdb_movies = pd.read_csv("zippedData/tmdb.movies.csv")
%store df_tmdb_movies

Stored 'df_tmdb_movies' (DataFrame)

In [23]:
%store -r df_tm_movies
%store -r dfgenreIds

In [24]:
df_tmdb_movies.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [25]:
df_tmdb_clean = df_tmdb_movies.drop(['Unnamed: 0', 'original_language', 'release_date', 'title'], axis=1)
df_tm_movies = df_tmdb_clean.set_index('id')

In [26]:
df_tm_movies.head()
#df_tm_movies.shape

,genre_ids,original_title,popularity,vote_average,vote_count
id,,,,,
12444,"[12, 14, 10751]",Harry Potter and the Deathly Hallows: Part 1,33.533,7.7,10788
10191,"[14, 12, 16, 10751]",How to Train Your Dragon,28.734,7.7,7610
10138,"[12, 28, 878]",Iron Man 2,28.515,6.8,12368
862,"[16, 35, 10751]",Toy Story,28.005,7.9,10174
27205,"[28, 878, 12]",Inception,27.920,8.3,22186

In [27]:
df_tm_movies['genre_ids'].notnull()

id
12444     True
10191     True
10138     True
862       True
27205     True
          ...
488143    True
485975    True
381231    True
366854    True
309885    True
Name: genre_ids, Length: 26517, dtype: bool

In [28]:
df_tm_movies['genre_ids'].isna().sum()

0

In [29]:
df_tm_movies.head()

,genre_ids,original_title,popularity,vote_average,vote_count
id,,,,,
12444,"[12, 14, 10751]",Harry Potter and the Deathly Hallows: Part 1,33.533,7.7,10788
10191,"[14, 12, 16, 10751]",How to Train Your Dragon,28.734,7.7,7610
10138,"[12, 28, 878]",Iron Man 2,28.515,6.8,12368
862,"[16, 35, 10751]",Toy Story,28.005,7.9,10174
27205,"[28, 878, 12]",Inception,27.920,8.3,22186

In [30]:
%store df_tm_movies

Stored 'df_tm_movies' (DataFrame)

## Here we pulled the dataframe made from TheMovieDB API and saved it as a csv to be readable in all notebooks without sharing the API key

In [31]:
dfgenreIds.to_csv('genreIds')

## Working with the TMDB movie dataset - we dropped some unneeded columns and set the index

In [40]:
df_tm_movies.head()

,genre_ids,original_title,popularity,vote_average,vote_count
id,,,,,
12444,"[12, 14, 10751]",Harry Potter and the Deathly Hallows: Part 1,33.533,7.7,10788
10191,"[14, 12, 16, 10751]",How to Train Your Dragon,28.734,7.7,7610
10138,"[12, 28, 878]",Iron Man 2,28.515,6.8,12368
862,"[16, 35, 10751]",Toy Story,28.005,7.9,10174
27205,"[28, 878, 12]",Inception,27.920,8.3,22186

In [41]:
# df_tm = df_tm_movies.drop(['genre_ids'], axis=1)
df_tmdb = df_tm_movies.set_index('original_title').sort_values('original_title')

In [42]:
df_tmdb.rename(columns = {'genre_ids' : 'genre_list'}, inplace = True)

In [43]:
df_tmdb.head()

,genre_list,popularity,vote_average,vote_count
original_title,,,,
"""BLESSED""","[99, 12]",0.600,7.0,1
"""Legitimate Rape"" Pharmaceutical Ad","[35, 80]",0.600,2.3,2
"""cherry"" - Supreme",[99],0.893,10.0,1
#1 Cheerleader Camp,"[35, 18]",3.277,3.6,34
#ALLMYMOVIES,[99],0.840,9.0,4

### We then stored our dataframe to use in other notebooks

In [44]:
%store df_tmdb

Stored 'df_tmdb' (DataFrame)

In [45]:
df = df_tmdb

## Here we made our genre_list column a pandas series and used a lambda function that pulled each number out of the list in each row and gave each number it's own column

In [46]:
genres = df['genre_list'].apply(pd.Series)
# rename each variable
genres = genres.rename(columns = lambda x : 'genre_' + str(x + 1))
# view the new dataframe
genres

                                             genre_1
original_title
"BLESSED"                                   [99, 12]
"Legitimate Rape" Pharmaceutical Ad         [35, 80]
"cherry" - Supreme                              [99]
#1 Cheerleader Camp                         [35, 18]
#ALLMYMOVIES                                    [99]
...                                              ...
하하하                                  [35, 18, 10749]
해양경찰 마르코                                [16, 12, 35]
황산벌                                  [36, 10752, 35]
황해                                      [18, 53, 80]
후궁: 제왕의 첩                                       [18]

[26517 rows x 1 columns]

##  We then used concat to merge those dataframes back together and again dropped some unneeded columns and stored the df for use in other notebooks.

In [47]:
df_genres = pd.concat([df[:], genres[:]], axis=1)

In [50]:
df_genres

,genre_list,popularity,vote_average,vote_count,genre_1
original_title,,,,,
"""BLESSED""","[99, 12]",0.600,7.0,1,"[99, 12]"
"""Legitimate Rape"" Pharmaceutical Ad","[35, 80]",0.600,2.3,2,"[35, 80]"
"""cherry"" - Supreme",[99],0.893,10.0,1,[99]
#1 Cheerleader Camp,"[35, 18]",3.277,3.6,34,"[35, 18]"
#ALLMYMOVIES,[99],0.840,9.0,4,[99]
...,...,...,...,...,...
하하하,"[35, 18, 10749]",2.611,6.6,16,"[35, 18, 10749]"
해양경찰 마르코,"[16, 12, 35]",0.600,8.0,1,"[16, 12, 35]"
황산벌,"[36, 10752, 35]",0.600,5.5,2,"[36, 10752, 35]"
황해,"[18, 53, 80]",11.253,7.4,181,"[18, 53, 80]"
후궁: 제왕의 첩,[18],13.209,5.8,31,[18]

In [49]:
# df = df_genres.drop(['genre_3', 'genre_4', 'genre_5', 'genre_6', 'genre_7'], axis=1)

In [51]:
df = df_genres

In [52]:
%store df

Stored 'df' (DataFrame)

In [53]:
df.reset_index(drop=True, inplace=True)

### More cleaning of the dataframe - sorted the values and changed the naming of a few

In [54]:
df_cleaning = df['genre_1'].value_counts().sort_values(ascending=False)

In [55]:
df.rename(columns = {'genre_1' : 'genres'}, inplace = True)
df.rename(columns = {'popularity' : 'Popularity'}, inplace = True)

In [56]:
df.head()

  genre_list  Popularity  vote_average  vote_count    genres
0   [99, 12]       0.600           7.0           1  [99, 12]
1   [35, 80]       0.600           2.3           2  [35, 80]
2       [99]       0.893          10.0           1      [99]
3   [35, 18]       3.277           3.6          34  [35, 18]
4       [99]       0.840           9.0           4      [99]

### We needed to change the numbers in our new genre columns to strings so we could search through them

In [57]:
df['genres'].apply(lambda x : str(x))

0               [99, 12]
1               [35, 80]
2                   [99]
3               [35, 18]
4                   [99]
              ...
26512    [35, 18, 10749]
26513       [16, 12, 35]
26514    [36, 10752, 35]
26515       [18, 53, 80]
26516               [18]
Name: genres, Length: 26517, dtype: object

### Then we were able to pull the top genres according to popularity

In [58]:
df_cleaning

[99]                         3700
[]                           2479
[18]                         2268
[35]                         1660
[27]                         1145
                             ...
[14, 53, 36]                    1
[878, 10749, 18]                1
[12, 28, 99]                    1
[878, 53, 18, 10749]            1
[10751, 35, 10749, 10770]       1
Name: genre_1, Length: 2477, dtype: int64

In [59]:
len(df_cleaning)

2477

In [60]:
%store df_cleaning

Stored 'df_cleaning' (Series)

## Here we iterated through our genres column to pull info only on our top genres and set it to a dataframe

In [61]:
dftop_genres = df.loc[(df['genres'] == '18') |
                        (df['genres'] == '99') | 
                      (df['genres'] == '35') |
                      (df['genres'] == '27') |
                      (df['genres'] == '28') |
                      (df['genres'] == '53') |
                      (df['genres'] == '16') |
                        (df['genres'] == '10749') |
                        (df['genres']  == '10402')]

In [62]:
dftop_genres['genres'].unique()

array([], dtype=object)

In [63]:
dftop = dftop_genres

In [64]:
%store dftop

Stored 'dftop' (DataFrame)

## Here we did the same to pull only our top grossing genres popularity information

In [65]:
dfgen_bud = df.loc[(df['genres'] == '28') |
                        (df['genres'] == '12') | 
                      (df['genres'] == '16') |
                      (df['genres'] == '14') |
                      (df['genres'] == '10751') |
                      (df['genres'] == '878') ]

In [66]:
dfgen_bud

Empty DataFrame
Columns: [genre_list, Popularity, vote_average, vote_count, genres]
Index: []

In [67]:
%store dfgen_bud

Stored 'dfgen_bud' (DataFrame)

In [68]:
df['genres'].notnull().value_counts()

True    26517
Name: genres, dtype: int64